//////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция СоздатьЗаписьИстории(ПараметрыЗаписи = Неопределено) Экспорт
	
	Результат = РегистрыСведений.ИсторияЗапросов.СоздатьМенеджерЗаписи();
	Результат.Идентификатор 	= Новый УникальныйИдентификатор;
	Результат.ДатаЗапроса 		= ТекущаяДатаСеанса();
	
	Если Не ПараметрыЗаписи = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Результат, ПараметрыЗаписи);
	КонецЕсли; // Если Не ПараметрыЗаписи = Неопределено Тогда
	
	Результат.Записать();
	
	Возврат	Результат.Идентификатор;
	
КонецФункции // СоздатьЗаписьИстории

Функция ОбновитьЗапись(Идентификатор, ПараметрыЗаписи) Экспорт
	Запись 					= РегистрыСведений.ИсторияЗапросов.СоздатьМенеджерЗаписи();
	Запись.Идентификатор 	= Идентификатор;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Возврат Ложь;
	КонецЕсли; // Если Не Запись.Выбран() Тогда
	
	Для Каждого Ресурс Из Метаданные.РегистрыСведений.ИсторияЗапросов.Ресурсы Цикл
		Если ПараметрыЗаписи.Свойство(Ресурс.Имя) Тогда
			Запись[Ресурс.Имя] = ПараметрыЗаписи[Ресурс.Имя];
		КонецЕсли; // Если ПараметрыЗаписи.Свойство(Ресурс.Имя) Тогда		
	КонецЦикла; // 	Для Каждого Ресурс Из Метаданные.РегистрыСведений.ИсторияЗапросов.Ресурсы Цикл
	
	Запись.Записать();
	Возврат Истина;
КонецФункции // ОбновитьЗапись
